; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
; params: satgen 652961 1 3 4 4 4
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	spectrograph3 - mode
	image0 - mode
	thermograph2 - mode
	image1 - mode
	GroundStation3 - direction
	Star0 - direction
	Star2 - direction
	GroundStation1 - direction
	Star4 - direction
	Planet5 - direction
	Phenomenon6 - direction
	Planet7 - direction
)
(:init
	(supports instrument0 image0)
	(calibration_target instrument0 Star0)
	(supports instrument1 image1)
	(calibration_target instrument1 Star2)
	(supports instrument2 thermograph2)
	(supports instrument2 image1)
	(supports instrument2 spectrograph3)
	(calibration_target instrument2 GroundStation1)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 GroundStation3)
)
(:goal (and
	(pointing satellite0 Phenomenon6)
	(have_image Star4 spectrograph3)
	(have_image Planet5 image0)
	(have_image Phenomenon6 thermograph2)
	(have_image Planet7 thermograph2)
))

)

; plan
1. (turn_to satellite0 star4 groundstation3)
   deleted: (pointing satellite0 groundstation3)
   added: (pointing satellite0 star4)
   goals met: 0 of 5
2. (switch_on instrument2 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument2)
   goals met: 0 of 5
3. (turn_to satellite0 groundstation1 star4)
   deleted: (pointing satellite0 star4)
   added: (pointing satellite0 groundstation1)
   goals met: 0 of 5
4. (calibrate satellite0 instrument2 groundstation1)
   added: (calibrated instrument2)
   goals met: 0 of 5
5. (turn_to satellite0 star4 groundstation1)
   deleted: (pointing satellite0 groundstation1)
   added: (pointing satellite0 star4)
   goals met: 0 of 5
6. (take_image satellite0 star4 instrument2 spectrograph3)
   added: (have_image star4 spectrograph3)
   goals met: 1 of 5
7. (turn_to satellite0 star0 star4)
   deleted: (pointing satellite0 star4)
   added: (pointing satellite0 star0)
   goals met: 1 of 5
8. (turn_to satellite0 planet7 star0)
   deleted: (pointing satellite0 star0)
   added: (pointing satellite0 planet7)
   goals met: 1 of 5
9. (take_image satellite0 planet7 instrument2 thermograph2)
   added: (have_image planet7 thermograph2)
   goals met: 2 of 5
10. (turn_to satellite0 star0 planet7)
   deleted: (pointing satellite0 planet7)
   added: (pointing satellite0 star0)
   goals met: 2 of 5
11. (turn_to satellite0 phenomenon6 star0)
   deleted: (pointing satellite0 star0)
   added: (pointing satellite0 phenomenon6)
   goals met: 3 of 5
12. (take_image satellite0 phenomenon6 instrument2 thermograph2)
   added: (have_image phenomenon6 thermograph2)
   goals met: 4 of 5
13. (switch_off instrument2 satellite0)
   deleted: (power_on instrument2)
   added: (power_avail satellite0)
   goals met: 4 of 5
14. (turn_to satellite0 star0 phenomenon6)
   deleted: (pointing satellite0 phenomenon6)
   added: (pointing satellite0 star0)
   goals met: 3 of 5
15. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 3 of 5
16. (calibrate satellite0 instrument0 star0)
   added: (calibrated instrument0)
   goals met: 3 of 5
17. (turn_to satellite0 planet5 star0)
   deleted: (pointing satellite0 star0)
   added: (pointing satellite0 planet5)
   goals met: 3 of 5
18. (take_image satellite0 planet5 instrument0 image0)
   added: (have_image planet5 image0)
   goals met: 4 of 5
19. (turn_to satellite0 phenomenon6 planet5)
   deleted: (pointing satellite0 planet5)
   added: (pointing satellite0 phenomenon6)
   goals met: 5 of 5
